In [23]:
import numpy as np
import pandas as pd
d = {
    'A': [1,2, np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1,2,3]
}
df=pd.DataFrame(d)

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [26]:
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [27]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [28]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
df.fillna(value='wow')

     A    B  C
0  1.0  5.0  1
1  2.0  wow  2
2  wow  wow  3

In [32]:
df=pd.DataFrame(d)

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
a = df['A'].fillna(value = df['A'].mean())

In [35]:
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64